# -*- coding: utf-8 -*-
import re

def frequency_counter (text):
    """ Counts the frequency of every word in the text """
    d = {}
    t = re.findall(ur"(?u)\w+", text.decode('utf-8').lower())

    for word in t:
        if re.search(ur"[^абвгдѓежзѕијклљмнњопрстќуфхцчџш]", word):
            return None
        d[word] = d.get(word, 0) + 1

    return d

###############################################################################
#-----------------TEST----------------------------------------------------------

def main():
    text = """Министерството за образование и наука позитивно ја оценува досегашната јавна дебата и дискусија
              која се реализира со цел да се унапреди и надгради предложениот пакет реформи за подигнување на
              квалитетот на севкупниот образовен систем во Република Македонија. Во таа насока, Министерството
              за образование и наука смета  дека денешниот предлог понуден од страна на Универзитетот “Св. Кирил
              и Методиј“ – Скопје, за спроведување на пилот проект за државниот испит, пред неговото официјално
              воведување е конструктивен и добар предлог, којшто позитивно го оценуваме и поддржуваме."""

    text1 = """От есента на 1896 той става учител в Банско, където работи два месеца и успява да изгради широка
               организационна мрежа от комитети в пограничните райони на Разложко и Горноджумайско като достига
               и до Неврокопско.[2] След това става задграничен представител на организацията в София. Като такъв
               участва в заседанията на Върховния македоно-одрински комитет. Същевременно като главен четнически
               инспектор и с помощта на български офицери създава четническия институт на ВМОРО в Княжество България,
               който започва да изпраща подготвени четници и войводи във вътрешността на Македония и изиграва основна
               роля в масовизирането на движението. Полага големи усилия и за снабдяването на организацията с оръжие
               и пари."""

    d = frequency_counter(text1)
    if d is None:
        print None
    else:
        for key in d:
            print '%s %d' % (key, d[key])



if __name__ == '__main__':
    main()



